<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 3.2 Final//EN">
<HTML>
<HEAD>
 <META NAME="GENERATOR" CONTENT="LinuxDoc-Tools 0.9.21">
 <TITLE>Gnu Privacy Guard (GnuPG) Mini Howto (italiano)</TITLE>
</HEAD>
<BODY>
<H1>Gnu Privacy Guard (GnuPG) Mini Howto (italiano)</H1>

<H2>Brenno J.S.A.A.F. de Winter (inglese) <CODE>&lt;brenno@dewinter.com&gt;</CODE>,
Michael Fischer v. Mollard (tedesco)
<CODE>&lt;fischer@math.uni-goettingen.de&gt;</CODE>,
Arjen Baart (olandese)
<CODE>&lt;arjen@andromeda.nl&gt;</CODE>,
Cristian Rigamonti (italiano)
<CODE>&lt;cri@linux.it&gt;</CODE></H2>Versione 0.1.4 12 maggio 2003
<HR>
<EM>  Questo documento spiega come usare GNU Privacy Guard (GnuPG), un sistema
  di crittografia Open Source e compatibile con OpenPGP.
  Per mantenere il programma totalmente libero, si &egrave; evitato l'uso di RSA e di
  altri algoritmi brevettati. Il documento originale &egrave; scritto in tedesco da   Michael Fischer v. Mollard, questa traduzione italiana, a cura di Cristian
  Rigamonti, &egrave; basata sulla traduzione inglese del testo originale.</EM>
<HR>
<P>
<H2><A NAME="toc1">1.</A> <A HREF="GPGMiniHowto_big.html#s1">Concetti</A></H2>

<UL>
<LI><A NAME="toc1.1">1.1</A> <A HREF="GPGMiniHowto_big.html#ss1.1">Crittografia a chiave pubblica</A>
<LI><A NAME="toc1.2">1.2</A> <A HREF="GPGMiniHowto_big.html#ss1.2">Firme digitali</A>
<LI><A NAME="toc1.3">1.3</A> <A HREF="GPGMiniHowto_big.html#ss1.3">Rete di fiducia</A>
<LI><A NAME="toc1.4">1.4</A> <A HREF="GPGMiniHowto_big.html#ss1.4">Limiti alla sicurezza</A>
</UL>
<P>
<H2><A NAME="toc2">2.</A> <A HREF="GPGMiniHowto_big.html#s2">Installazione</A></H2>

<UL>
<LI><A NAME="toc2.1">2.1</A> <A HREF="GPGMiniHowto_big.html#ss2.1">Sorgenti di GnuPG</A>
<LI><A NAME="toc2.2">2.2</A> <A HREF="GPGMiniHowto_big.html#ss2.2">Configurazione </A>
<LI><A NAME="toc2.3">2.3</A> <A HREF="GPGMiniHowto_big.html#ss2.3">Compilazione </A>
<LI><A NAME="toc2.4">2.4</A> <A HREF="GPGMiniHowto_big.html#ss2.4">Installazione</A>
</UL>
<P>
<H2><A NAME="toc3">3.</A> <A HREF="GPGMiniHowto_big.html#s3">Uso delle chiavi</A></H2>

<UL>
<LI><A NAME="toc3.1">3.1</A> <A HREF="GPGMiniHowto_big.html#ss3.1">Creare una chiave</A>
<LI><A NAME="toc3.2">3.2</A> <A HREF="GPGMiniHowto_big.html#ss3.2">Esportare le chiavi</A>
<LI><A NAME="toc3.3">3.3</A> <A HREF="GPGMiniHowto_big.html#ss3.3">Importare le chiavi</A>
<LI><A NAME="toc3.4">3.4</A> <A HREF="GPGMiniHowto_big.html#ss3.4">Revocare una chiave</A>
<LI><A NAME="toc3.5">3.5</A> <A HREF="GPGMiniHowto_big.html#ss3.5">Amministrazione delle chiavi</A>
<LI><A NAME="toc3.6">3.6</A> <A HREF="GPGMiniHowto_big.html#ss3.6">Firmare le chiavi</A>
</UL>
<P>
<H2><A NAME="toc4">4.</A> <A HREF="GPGMiniHowto_big.html#s4">Cifrare e decifrare</A></H2>

<UL>
<LI><A NAME="toc4.1">4.1</A> <A HREF="GPGMiniHowto_big.html#ss4.1">Cifrare</A>
<LI><A NAME="toc4.2">4.2</A> <A HREF="GPGMiniHowto_big.html#ss4.2">Decifrare</A>
</UL>
<P>
<H2><A NAME="toc5">5.</A> <A HREF="GPGMiniHowto_big.html#s5">Firmare e verificare le firme</A></H2>

<P>
<H2><A NAME="toc6">6.</A> <A HREF="GPGMiniHowto_big.html#s6">Front-end</A></H2>

<UL>
<LI><A NAME="toc6.1">6.1</A> <A HREF="GPGMiniHowto_big.html#ss6.1">Interfacce grafiche</A>
<LI><A NAME="toc6.2">6.2</A> <A HREF="GPGMiniHowto_big.html#ss6.2">Programmi di posta elettronica</A>
</UL>
<P>
<H2><A NAME="toc7">7.</A> <A HREF="GPGMiniHowto_big.html#s7">Fonti di informazioni</A></H2>

<UL>
<LI><A NAME="toc7.1">7.1</A> <A HREF="GPGMiniHowto_big.html#ss7.1">GnuPG</A>
<LI><A NAME="toc7.2">7.2</A> <A HREF="GPGMiniHowto_big.html#ss7.2">PGP</A>
<LI><A NAME="toc7.3">7.3</A> <A HREF="GPGMiniHowto_big.html#ss7.3">Keyserver</A>
<LI><A NAME="toc7.4">7.4</A> <A HREF="GPGMiniHowto_big.html#ss7.4">Libri</A>
</UL>
<P>
<H2><A NAME="toc8">8.</A> <A HREF="GPGMiniHowto_big.html#s8">Informazioni su questo documento </A></H2>

<UL>
<LI><A NAME="toc8.1">8.1</A> <A HREF="GPGMiniHowto_big.html#ss8.1">Versioni</A>
</UL>

<HR>
<H2><A NAME="GPG-Minihowto-Concept"></A> <A NAME="s1">1.</A> <A HREF="#toc1">Concetti</A></H2>

<H2><A NAME="ss1.1">1.1</A> <A HREF="#toc1.1">Crittografia a chiave pubblica</A>
</H2>

<P>I metodi classici di crittografia usano una sola chiave per cifrare:
il mittente cifra il messaggio con una chiave e il destinatario decifra 
il messaggio con questa stessa chiave, che gli deve essere fornita dal mittente
con modalit&agrave; che impediscano ad altri di entrarne in possesso. Se qualcun altro
possiede la chiave, questi metodi crittografici diventano inutili.</P>

<P>L'uso della cosiddetta crittografia a chiave pubblica pu&ograve; risolvere questo
problema. La crittografia a chiave pubblica prevede due chiavi: una chiave
pubblica, che pu&ograve; essere diffusa con ogni mezzo, e una chiave privata, che non
va diffusa e deve essere mantenuta segreta dal proprietario. Se il sistema &egrave;
implementato bene, dalla chiave pubblica non si pu&ograve; risalire a quella privata.
In questo modo, il mittente cifrer&agrave; il messaggio con la chiave pubblica del
destinatario e quest'ultimo lo decifrer&agrave; con la propria chiave privata.</P>

<P>&Egrave; cruciale che la chiave privata resti segreta e non sia a disposizione di
nessuno all'infuori del proprietario: NON PU&Ograve; ESSERE SPEDITA ATTRAVERSO
INTERNET!  &Egrave; anche altamente sconsigliato usare GnuPG via <CODE>telnet</CODE> 
(&egrave; consigliabile non usare mai telnet, visti i suoi alti rischi di
sicurezza).</P>

<H2><A NAME="ss1.2">1.2</A> <A HREF="#toc1.2">Firme digitali</A>
</H2>


<P>Per provare che un certo messaggio &egrave; stato inviato proprio dalla 
persona che dichiara di averlo fatto, &egrave; stato inventato il concetto 
di firma digitale. Con questa firma si pu&ograve; verificare l'autenticit&agrave; 
di un messaggio, riducendo i rischi di imbattersi in un "cavallo di Troia" 
(ad esempio un messaggio che afferma di essere una patch per un certo 
problema, ma in realt&agrave; contiene un virus, o causa danni ai dati del
vostro computer). Si pu&ograve; quindi verificare che qualsiasi informazione o 
dato provenga dalla fonte legittimata ad emetterlo.</P>

<P>Una firma digitale si ottiene dalla combinazione tra la chiave privata e il
testo. Usando la chiave pubblica del mittente si pu&ograve; verificare un messaggio e
controllare non solo che sia stato inviato dalla persona corretta, ma anche che il 
contenuto non sia stato modificato durante il trasporto.</P>

<H2><A NAME="ss1.3">1.3</A> <A HREF="#toc1.3">Rete di fiducia</A>
</H2>

<P>Un punto debole degli algoritmi a chiave pubblica &egrave; la diffusione delle chiavi.
Un utente potrebbe spacciarsi per qualcun'altro, facendo circolare una chiave
pubblica con un falso user ID e intercettando tutti i messaggi che venissero
cifrati per quell'user ID. L'impostore potrebbe, dopo aver intercettato il
messaggio, cifrarlo con la vera chiave pubblica del destinatario originale e 
inviarglielo, senza che quest'ultimo si renda conto dell'intercettazione.</P>

<P>La soluzione adottata da PGP (e quindi da GnuPG) &egrave; la firma delle chiavi:
una chiave pubblica pu&ograve; essere firmata da altre persone, certificando cos&igrave; che
la chiave appartiene veramente alla persona che sostiene di esserne il
proprietario. La decisione su quanta fiducia riporre nelle firme spetta
all'utente di GnuPG: sostanzialmente la fiducia in una firma dipende dalla
fiducia che si ha nella chiave della persona che ha apposto la firma.
Per essere assolutamente sicuri che una chiave appartenga a una certa persona,
&egrave; consigliabile fare un controllo della cosiddetta "impronta digitale" della 
chiave (&quot;fingerprint&quot;) usando un canale di comunicazione sicuro.</P>

<H2><A NAME="ss1.4">1.4</A> <A HREF="#toc1.4">Limiti alla sicurezza</A>
</H2>


<P>Se si possiedono dati considerati confidenziali, occorre preoccuparsi non
solo del tipo di algoritmo di cifratura da usare, ma anche della sicurezza
generale del proprio sistema. Fondamentalmente PGP pu&ograve; essere considerato sicuro
e al momento della scrittura di questo documento non sono noti esempi di
attacchi riusciti a PGP, ma ci&ograve; non implica una sicurezza assoluta (ad esempio,
se la NSA riuscisse a rompere PGP non lo direbbe facilmente, n&eacute; lo farebbero
altre persone che cercano di rompere i sistemi con scopi criminali). Comunque,
anche se PGP fosse completamente inattaccabile, resterebbero altre minacce per
la sicurezza.  Nel febbraio 1999 fu scoperto un cavallo di Troia che cercava
chiavi private PGP sull'hard disk e le spediva via FTP: se le passphrase
fossero state scelte male, le chiavi private avrebbero potuto facilmente essere
scoperte.</P>

<P>Un possibile attacco (anche se poco probabile) &egrave; costituito da un cavallo di
Troia che ritrasmetta ci&ograve; che si scrive sulla tastiera. &Egrave; anche tecnicamente
possibile (ma molto difficile) copiare il contenuto dello schermo: in questo
caso non occorrerebbe decifrare alcun messaggio cifrato. Per tutti questi
rischi occorre mettere in opera un buon sistema di sicurezza.</P>

<P>Non si tratta di diffondere la paranoia tra la gente, quanto piuttosto la
consapevolezza che ci sono molti aspetti da considerare per essere pi&ugrave; sicuri:
la cosa pi&ugrave; importante &egrave; tenere in mente che la crittografia &egrave; solo uno dei passi
verso la sicurezza, non una soluzione totale. I cavalli di Troia, come il virus
Melissa del marzo 1999, hanno spesso colto molte societ&agrave; impreparate.</P>

<H2><A NAME="s2">2.</A> <A HREF="#toc2">Installazione</A></H2>


<H2><A NAME="ss2.1">2.1</A> <A HREF="#toc2.1">Sorgenti di GnuPG</A>
</H2>


<P>Il sito ufficiale da cui scaricare &egrave; la
<A HREF="http://www.gnupg.org/download.html">homepage di GnuPG</A>. 
A questo indirizzo si troveranno anche link a siti mirror.</P>
<P>A causa di restrizioni legali &egrave; vietato scaricare GnuPG da server che si trovano
negli USA: gli USA pongono restrizioni all'esportazione di software
crittografico. &Egrave; il motivo per cui PGP &egrave; disponibile in una versione
internazionale e una nazionale (per gli USA). Per scrivere la versione
internazionale, il codice sorgente &egrave; stato esportato sotto forma di libro
stampato ed &egrave; stato scansito in Europa (Oslo); maggiori informazioni in
proposito possono essere trovate sulla 
<A HREF="http://www.pgpi.com">homepage di PGP International</A>.
La versione internazionale di PGP pu&ograve; essere importata liberamente negli Stati
Uniti, a patto che non venga ri-esportata.</P>

<P>Se si ha gi&agrave; una versione di GnuPG o PGP, &egrave; consigliabile verificare il file di
firma (si veda la sezione 
<A HREF="#GPG-Minihowto-signatures">Firmare e verificare le firme</A>).</P>

<H2><A NAME="ss2.2">2.2</A> <A HREF="#toc2.2">Configurazione </A>
</H2>

<P>&Egrave; possibile procurarsi GnuPG sotto forma di pacchetto Debian, di pacchetto RPM 
(Redhat Package Manager) o di codice sorgente. GnuPG &egrave; incluso nelle ultime 
distribuzioni RedHat.
Per controllare se lo si ha gi&agrave; sul proprio sistema si usi:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
rpm -q gnupg
</PRE>
</CODE></BLOCKQUOTE>
  </P>
<P>I pacchetti binari sono installati usando gli strumenti caratteristici delle
varie piattaforme Linux. Per installare GnuPG su altre piattaforme occorre 
compilarlo da s&eacute;. Chiunque renda disponibile al pubblico un metodo di
installazione per una nuova piattaforma far&agrave; cosa gradita.</P>

<P>Visto che lo sviluppo principale viene fatto su piattaforma Linux (x86), non
dovrebbe essere difficile portare GnuPG su altri sistemi. La lista dei sistemi
operativi che attualmente supportano GnuPG si pu&ograve; trovare sulla
<A HREF="http://www.gnupg.org">homepage di GnuPG</A>. 
La procedura descritta di seguito &egrave; abbastanza indipendente dalla piattaforma e pu&ograve;
essere usata per installare GnuPG partendo dal file tar dei sorgenti.</P>


<P>Si decomprima il file tar con i comandi:
<BLOCKQUOTE><CODE>
<PRE>
tar xvzf gnupg-?.?.?.tar.gz
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>Dopodich&eacute; si entri nella directory che contiene il codice sorgente e si scriva:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
./configure
</PRE>
</CODE></BLOCKQUOTE>
  </P>
<P>Non dovrebbe succedere nulla di speciale. Con</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
./configure --help
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>&egrave; possibile vedere le impostazioni disponibili per la compilazione. Se ci sono
problemi di internazionalizzazione, &egrave; possibile usare le librerie gettext
incluse nel sorgente, usando l'opzione <CODE>--with-included-gettext</CODE>, o
disabilitarle usando l'opzione <CODE>--disable-NLS</CODE>.</P>

<H2><A NAME="ss2.3">2.3</A> <A HREF="#toc2.3">Compilazione </A>
</H2>


<P>A questo punto, &egrave; possibile compilare il programma con il comando
<BLOCKQUOTE><CODE>
<PRE>
make
</PRE>
</CODE></BLOCKQUOTE>
 
Se dovessero verificarsi problemi, &egrave; consigliabile nell'ordine: cercare di
risolvere il problema facendo uso della documentazione disponibile,
controllare che il problema non sia dovuto a un bug (controllando il file
BUGS su http://www.gnupg.org), chiedere a qualche conoscente e solo a questo
punto chiedere sulla mailing list di GnuPG (si veda la sezione
<A HREF="#GPG-Minihowto-Informationsources">Fonti di informazioni</A>). Se
il problema riguarda i percorsi sul sistema, occorre eseguire <CODE>make clean</CODE>,
quindi eseguire di nuovo <CODE>configure</CODE> e riprovare a compilare.
Se ancora non funziona, siete autorizzati a farvi prendere dal panico!</P>

<H2><A NAME="ss2.4">2.4</A> <A HREF="#toc2.4">Installazione</A>
</H2>


<P>Si esegua:
<BLOCKQUOTE><CODE>
<PRE>
make install
</PRE>
</CODE></BLOCKQUOTE>

per copiare il programma e le pagine di manuale nella directory di
installazione, che, a meno di modifiche apportate al ./configure, sar&agrave;
<CODE>usr/local/share/gnupg/</CODE>. Si pu&ograve; trovare questa directory anche nel
file <CODE>options.skel</CODE>, che pu&ograve; essere modificato e copiato come
<CODE>~/.gnupg/options</CODE>, in modo che le modifiche apportate siano usate
come standard. Questa copia viene eseguita automaticamente durante la
creazione di <CODE>~/.gnupg/</CODE>. Le opzioni possibili sono tutte ben
documentate e non &egrave; necessario spiegarle qui nel dettaglio.</P>

<P>&Egrave; possibile eseguire GnuPG suid root, in modo che il programma giri con
tutti i diritti dell'utente root e non scriva dati in locazioni
di memoria teoricamente accessibili da altri. Non si pu&ograve; giudicare a priori
quanto questo sia rischioso, d'altra parte si tenga anche conto che
eseguire il programma suid root rende pi&ugrave; pericolosi gli effetti di un
eventuale cavallo di Troia (un cavallo di Troia che gira come utente root
pu&ograve; danneggiare un intero sistema). Se si sceglie, per questo motivo o per
altri, di non eseguire GnuPG suid root, &egrave; possibile disabilitare il relativo
messaggio di avvertimento impostando <CODE>no-secmem-warning</CODE> in 
<CODE>~/.gnupg/options</CODE>.</P>


<H2><A NAME="GPG-Minihowto-Key"></A> <A NAME="s3">3.</A> <A HREF="#toc3">Uso delle chiavi</A></H2>


<H2><A NAME="ss3.1">3.1</A> <A HREF="#toc3.1">Creare una chiave</A>
</H2>


<P>Con 
<BLOCKQUOTE><CODE>
<PRE>
gpg --gen-key
</PRE>
</CODE></BLOCKQUOTE>
 
verr&agrave; creata una nuova coppia di chiavi (una pubblica e una privata).
Il primo problema &egrave; quale algoritmo usare: maggiori informazioni sugli
algoritmi si trovano nella 
<A HREF="http://www.scramdisk.clara.net/pgpfaqfs.html">PGP DH vs. RSA FAQ</A> o in 
<A HREF="#BSchneier">Applied Cryptography</A>.
La scelta predefinita (e la pi&ugrave; usata) &egrave; quella di usare l'algoritmo 
DSA/ElGamal, che non &egrave; brevettato.</P>

<P>Il secondo problema &egrave; la lunghezza della chiave. In questo caso la scelta
dipende dalle preferenze dell'utente tra sicurezza e tempo di calcolo: se
una chiave &egrave; lunga, diminuisce il rischio di decifrare abusivamente un messaggio 
intercettato, ma aumenta il tempo di calcolo per cifrare e decifrare.
Se si &egrave; preoccupati per il tempo di calcolo, ma si ha intenzione di usare la
chiave per un periodo di tempo abbastanza lungo, si tenga conto dell'aumento di
prestazioni dei processori, che diventano sempre pi&ugrave; veloci.
La lunghezza minima per una chiave GnuPG &egrave; di 768 bit; la lunghezza standard
per le chiavi DSA &egrave; di 1024 bit, anche se molti raccomandano di usare chiavi 
da 2048 bit (che al momento &egrave; anche la lunghezza massima supportata da
GnuPG). Se la sicurezza &egrave; il fattore di gran lunga pi&ugrave; importante, &egrave;
consigliabile scegliere la massima lunghezza di chiave disponibile.</P>

<P>Successivamente, il sistema chieder&agrave; di inserire nomi, commenti e indirizzi
e-mail, che verranno usati per la costruzione della chiave; questi potranno
essere modificati in parte anche successivamente, si veda la sezione
<A HREF="#GPG-Minihowto-KPAdministration">Amministrazione delle chiavi</A>.</P>

<P>Infine, occorre scegliere una password (di solito si usa il termine
"passphrase", frase segreta, visto che sono ammessi gli spazi), che andr&agrave;
immessa ogni volta che si useranno funzionalit&agrave; che richiedono la chiave
privata.  Una buona passphrase ha le seguenti caratteristiche:
<UL>
<LI>&egrave; lunga</LI>
<LI>contiene caratteri speciali (non alfanumerici)</LI>
<LI>&egrave; una "parola" speciale (non un nome)</LI>
<LI>&egrave; molto difficile da indovinare (quindi niente nomi, date di nascita,
numeri di telefono o di carta di credito, nomi di bambini, ecc.)</LI>
</UL>

Si pu&ograve; migliorare la sicurezza anche usando Le MAiusCOLe aLTernATe allE
mInusCOLe. Nello scegliere la passphrase, assicurarsi di NON DIMENTICARLA:
se succedesse, non sarebbe pi&ugrave; possibile usare la propria
chiave privata, ad esempio per leggere i messaggi ricevuti.
&Egrave; cosa saggia anche generare un certificato che contiene queste informazioni
(e conservarlo con cura in un luogo sicuro). Si veda la sezione
<A HREF="#GPG-Minihowto-Revoke">Revocare una chiave</A>.</P>

<P>Dopo aver immesso tutti i dati, il sistema inizer&agrave; a generare le chiavi.
Questa operazione richieder&agrave; un po' di tempo, durante il quale il sistema
deve raccogliere molti dati casuali. Si pu&ograve; aiutare a generare dati casuali
ad esempio lavorando su un'altra finestra. Ogni chiave generata &egrave; diversa
dalle altre: se si genera una chiave e dopo cinque minuti se ne genera
un'altra fornendo gli stessi dati (nome, email, passphrase, ecc.), si otterr&agrave;
una chiave diversa. Ecco perch&egrave; &egrave; importante non dimenticarsi la passphrase.</P>


<H2><A NAME="ss3.2">3.2</A> <A HREF="#toc3.2">Esportare le chiavi</A>
</H2>


<P>Il comando per esportare la chiave di un utente &egrave;:
<BLOCKQUOTE><CODE>
<PRE>
gpg --export [UID]
</PRE>
</CODE></BLOCKQUOTE>

Se non si indica un UID (User ID), verranno esportate tutte le chiavi
presenti nel portachiavi. L'output predefinito &egrave; lo <CODE>stdout</CODE>, ma &egrave;
possibile dirigere l'output su un file usando l'opzione <CODE>-o</CODE>.
In molti casi &egrave; consigliabile usare l'opzione <CODE>-a</CODE> per scrivere la
chiave in un file ASCII a 7 bit, invece che in un file binario.</P>

<P>Per allargare il proprio orizzonte e permettere ad altri di inviare
messaggi in modo sicuro, occorre esportare la propria chiave pubblica e
pubblicarla sulla propria home page, o tramite finger, oppure caricarla su
un key server come http://www.pca.dfn.de/dfnpca/pgpkserv/, o ancora usando
altri metodi.</P>

<H2><A NAME="ss3.3">3.3</A> <A HREF="#toc3.3">Importare le chiavi</A>
</H2>


<P>Quando si riceve la chiave pubblica di qualcuno, prima di usarla occorre
importarla nel proprio portachiavi (si pu&ograve; farlo anche per pi&ugrave; di una chiave
alla volta). Il comando &egrave; il seguente:
<BLOCKQUOTE><CODE>
<PRE>
gpg --import [nomefile]
</PRE>
</CODE></BLOCKQUOTE>

se si omette il nome del file, i dati verranno letti dallo <CODE>stdin</CODE>.</P>

<H2><A NAME="GPG-Minihowto-Revoke"></A> <A NAME="ss3.4">3.4</A> <A HREF="#toc3.4">Revocare una chiave</A>
</H2>

<P>Ci sono vari motivi per voler revocare una chiave esistente, ad esempio se
la chiave privata &egrave; stata smarrita o &egrave; caduta nelle mani sbagliate, oppure se
non si vuole pi&ugrave; usare lo stesso UID, oppure se la lunghezza della chiave non &egrave;
pi&ugrave; sufficiente, ecc.
In tutti questi casi, il comando per revocare la chiave &egrave;:
<BLOCKQUOTE><CODE>
<PRE>
gpg --gen-revoke
</PRE>
</CODE></BLOCKQUOTE>

che genera un certificato di revoca.
<EM>Per poter fare questo occorre la chiave privata</EM>, altrimenti
chiunque potrebbe revocare la chiave. Questo ha uno svantaggio: se si
dimentica la passphrase, la chiave diventa inutilizzabile e non &egrave; neanche
possibile revocarla! Per evitare questo inconveniente, &egrave; buona norma creare
un certificato di revoca non appena si genera la chiave; esso andr&agrave;
conservato in un luogo sicuro (pu&ograve; essere salvato su disco, su carta, ecc.),
badando che non cada nelle mani sbagliate, altrimenti qualcun altro potrebbe
revocare la chiave rendendola inutilizzabile.</P>

<H2><A NAME="GPG-Minihowto-KPAdministration"></A> <A NAME="ss3.5">3.5</A> <A HREF="#toc3.5">Amministrazione delle chiavi</A>
</H2>


<P>Il sistema GnuPG comprende dei file che servono per immagazzinare tutte le
informazioni che accompagnano le chiavi (tutte tranne i valori di fiducia nel
proprietario della chiave: per maggiori informazioni in proposito si veda la 
sezione 
<A HREF="#GPG-Minihowto-KSigning">Firmare le chiavi</A>).
Con
<BLOCKQUOTE><CODE>
<PRE>
gpg --list-keys
</PRE>
</CODE></BLOCKQUOTE>

verranno mostrate tutte le chiavi esistenti. Per vedere anche le firme, si
usi:
<BLOCKQUOTE><CODE>
<PRE>
 gpg --list-sigs 
</PRE>
</CODE></BLOCKQUOTE>
 
(si veda la sezione 
<A HREF="#GPG-Minihowto-KSigning">Firmare le chiavi</A> per maggiori informazioni). 
Per vedere le impronte digitali si usi:
<BLOCKQUOTE><CODE>
<PRE>
gpg --fingerprint 
</PRE>
</CODE></BLOCKQUOTE>

Vedere le impronte digitali (&quot;Fingerprint&quot;) serve ad assicurarsi
che la chiave appartenga davvero alla persona che sostiene di esserne il
proprietario (ad esempio al telefono). L'output di questo comando &egrave; una
breve lista di numeri.</P>
<P>Per vedere la lista delle chiavi private si usi:
<BLOCKQUOTE><CODE>
<PRE>
gpg --list-secret-keys
</PRE>
</CODE></BLOCKQUOTE>
 
Si noti che non ha alcuna utilit&agrave; vedere firme o impronte digitali di chiavi
private.</P>
<P>Per cancellare una chiave pubblica si usi:
<BLOCKQUOTE><CODE>
<PRE>
gpg --delete-key UID 
</PRE>
</CODE></BLOCKQUOTE>

Per cancellare una chiave privata si usi:
<BLOCKQUOTE><CODE>
<PRE>
 gpg --delete-secret-key 
</PRE>
</CODE></BLOCKQUOTE>
 </P>
<P>C'&egrave; un altro comando importante per la gestione delle chiavi:
<BLOCKQUOTE><CODE>
<PRE>
gpg --edit-key UID
</PRE>
</CODE></BLOCKQUOTE>

Usando questo comando &egrave; possibile modificare (tra le altre cose) la data di
scadenza di una chiave, aggiungere UID o firmare una chiave (ovviamente per
questo &egrave; necessaria la propria passphrase). Dopo aver eseguito il comando
--edit-key si otterr&agrave; un prompt interattivo da cui digitare i comandi
successivi.</P>

<H2><A NAME="GPG-Minihowto-KSigning"></A> <A NAME="ss3.6">3.6</A> <A HREF="#toc3.6">Firmare le chiavi</A>
</H2>


<P>Come accennato nell'introduzione, il principale tallone d'Achille del
sistema &egrave; l'autenticit&agrave; delle chiavi pubbliche: se si usa una chiave
pubblica contraffatta si pu&ograve; dire addio alla crittografia sicura.
Per evitare questo rischio, c'&egrave; la possibilit&agrave; di firmare le chiavi, ossia
di porre la propria firma digitale sulla chiave, certificandone la validit&agrave;.
In pratica, la firma certifica che lo user ID menzionato nella chiave 
corrisponde alla persona che possiede la chiave. Una volta che si &egrave;
certi di questo, si pu&ograve; usare la chiave in tutta sicurezza.</P>

<P>Per firmare una chiave, si usi il comando <CODE>gpg --edit-key UID</CODE> e
successivamente il comando <CODE>sign</CODE>.</P>

<P><EM>Bisogna firmare una chiave solo quando si &egrave; ASSOLUTAMENTE CERTI della
sua autenticit&agrave;!!!</EM>
Questa condizione pu&ograve; verificarsi quando si &egrave; ricevuta la chiave direttamente 
da una persona (ad esempio durante un "key signing party", un raduno per la
firma delle chiavi) o quando la si &egrave; ricevuta per altri mezzi e se ne &egrave;
controllata l'autenticit&agrave; col metodo dell'impronta digitale (ad esempio al
telefono). Non si dovrebbe mai firmare una chiave a priori.</P>

<P>GnuPG calcola la validit&agrave; delle chiavi basandosi sulle firme disponibili e
sui valori di fiducia nel proprietario (&quot;ownertrust&quot;).
La fiducia nel proprietario di una chiave rappresenta la fiducia che si ripone 
nella capacit&agrave; del proprietario di firmare correttamente altre chiavi. 
I valori possibili sono:
<UL>
<LI> 1 = Indefinito</LI>
<LI> 2 = Nessuna fiducia</LI>
<LI> 3 = Fiducia marginale</LI>
<LI> 4 = Fiducia completa</LI>
</UL>

Cos&igrave;, se non si ha fiducia nel proprietario di una chiave, le eventuali
firme apposte da quest'ultimo su un'altra chiave veranno ignorate durante
il calcolo del valore di validit&agrave; della chiave.
Le informazioni sulla fiducia non sono immagazzinate negli stessi file che
contengono le chiavi, ma in un file separato.</P>

<H2><A NAME="GPG-Minihowto-encrypt"></A> <A NAME="s4">4.</A> <A HREF="#toc4">Cifrare e decifrare</A></H2>

<P>Dopo aver installato e configurato il programma nel modo voluto, &egrave; possibile
iniziare a cifrare e decifrare.</P>
<P>Si pu&ograve; usare il programma con pi&ugrave; di una chiave privata, selezionando per
ogni operazione quale deve essere quella attiva, con l'opzione <CODE>-u UID</CODE> o
l'opzione <CODE> --local-user UID</CODE>. In questo modo la chiave privata
predefinita sar&agrave; sostituita da quella indicata.</P>
<P>Per modificare invece il destinatario, si pu&ograve; usare l'opzione <CODE>-r</CODE>
o l'opzione <CODE>--recipient</CODE>.</P>

<H2><A NAME="ss4.1">4.1</A> <A HREF="#toc4.1">Cifrare</A>
</H2>


<P>Il comando per cifrare &egrave;
<BLOCKQUOTE><CODE>
<PRE>
gpg -e destinatario [dati]
</PRE>
</CODE></BLOCKQUOTE>

o
<BLOCKQUOTE><CODE>
<PRE>
gpg --encrypt destinatario [dati]
</PRE>
</CODE></BLOCKQUOTE>

Per evitare il rischio che qualcun altro si spacci per noi, &egrave; consigliabile
firmare qualsiasi cosa si voglia cifrare; si veda la sezione
<A HREF="#GPG-Minihowto-signatures">Firmare e verificare le firme</A>.</P>

<H2><A NAME="ss4.2">4.2</A> <A HREF="#toc4.2">Decifrare</A>
</H2>

<P>Il comando per decifrare &egrave;:
<BLOCKQUOTE><CODE>
<PRE>
gpg [-d] [dati] 
</PRE>
</CODE></BLOCKQUOTE>

o
<BLOCKQUOTE><CODE>
<PRE>
gpg [--decrypt] [dati]
</PRE>
</CODE></BLOCKQUOTE>

Anche in questo caso, l'output predefinito &egrave; lo <CODE>stdout</CODE>, ma &egrave;
possibile redirigere l'output a un file con l'opzione <CODE>-o</CODE>.</P>

<H2><A NAME="GPG-Minihowto-signatures"></A> <A NAME="s5">5.</A> <A HREF="#toc5">Firmare e verificare le firme</A></H2>

<P>Per firmare dati con la propria chiave, si usa il comando:
<BLOCKQUOTE><CODE>
<PRE>
gpg -s (o --sign) [dati]
</PRE>
</CODE></BLOCKQUOTE>

Durante questa operazione, i dati vengono anche compressi, quindi il
risultato non sar&agrave; leggibile. Per avere un risultato leggibile si pu&ograve; usare:</P>
<P>
<BLOCKQUOTE><CODE>
<PRE>
gpg --clearsign [dati]
</PRE>
</CODE></BLOCKQUOTE>
 </P>
<P>In questo modo si firmeranno i dati lasciandoli leggibili.</P>
<P>Con 
<BLOCKQUOTE><CODE>
<PRE>
gpg -b (o --detach-sign) [dati]
</PRE>
</CODE></BLOCKQUOTE>
 
&egrave; possibile scrivere la firma in un file separato. Questa opzione &egrave; utile
specialmente per firmare file binari (come ad esempio archivi).
Anche l'opzione <CODE>--armor</CODE> pu&ograve; tornare utile.</P>

<P>Spesso si troveranno dati cifrati e firmati allo stesso tempo. Il comando
completo &egrave;:
<BLOCKQUOTE><CODE>
<PRE>
gpg [-u mittente] [-r destinatario] [--armor] --sign --encrypt [dati]
</PRE>
</CODE></BLOCKQUOTE>
</P>
<P>L'utilizzo delle opzioni <CODE>-u</CODE> (<CODE>--local-user</CODE>) e <CODE>-r</CODE> 
(<CODE>--recipient</CODE>) &egrave; stato descritto in precedenza.</P>

<P>Quando dei dati cifrati sono stati anche firmati, la firma viene verificata
dopo aver decifrato i dati. &Egrave; possibile verificare le firme con il comando
<BLOCKQUOTE><CODE>
<PRE>
gpg [--verify] [dati]
</PRE>
</CODE></BLOCKQUOTE>

Ovviamente per fare questo &egrave; necessario possedere la chiave pubblica del
mittente.</P>

<H2><A NAME="GPG-Minihowto-frontends"></A> <A NAME="s6">6.</A> <A HREF="#toc6">Front-end</A></H2>


<P>L'uso di GnuPG &egrave; molto facilitato grazie all'esistenza di una vasta scelta di 
programmi che usano o supportano la crittografia di GnuPG.
Ci sono front-end grafici che consentono di gestire le chiavi con semplici
clic del mouse, e molti programmi di posta elettronica permettono di cifrare
e decifrare i messaggi in modo automatico.
Una lista quasi completa di front-end &egrave; disponibile sulla pagina
<A HREF="http://www.gnupg.org/related_software/frontends.html">GnuPG front-end</A>.
Ne illustreremo alcuni in questo capitolo.</P>

<H2><A NAME="ss6.1">6.1</A> <A HREF="#toc6.1">Interfacce grafiche</A>
</H2>



<H3>GPA</H3>

<P>
<A HREF="http://www.gnupg.org/gpa.html">GPA</A>, <EM>GNU Privacy
Assistant</EM> &egrave; un'interfaccia utente grafica per GNU Privacy Guard
(GnuPG), sviluppata nell'ambito del progetto GnuPG.
Con GPA, &egrave; possibile vedere il proprio portachiavi, importare ed esportare
chiavi, generarle, modificarne le caratteristiche e cifrare, firmare o
decifrare documenti. Installare GPA &egrave; facile: occorre scaricare il
pacchetto, decomprimerlo ed eseguire la solita sequenza:
<BLOCKQUOTE><CODE>
<PRE>
./configure; make; make install.
</PRE>
</CODE></BLOCKQUOTE>

Il programma si esegue digitando 
<BLOCKQUOTE><CODE>
<PRE>
gpa
</PRE>
</CODE></BLOCKQUOTE>
</P>

<H3>Seahorse</H3>

<P>
<A HREF="http://seahorse.sourceforge.net/">Seahorse</A> &egrave; un front-end
GNOME per GnuPG.  Pu&ograve; essere usato per cifrare, firmare e decifrare testi e
altri file.  Il testo pu&ograve; essere preso dagli appunti o scritto direttamente con
il piccolo editor incluso. Seahorse ha anche un gestore di chiavi che pu&ograve;
essere usato per modificare quasi tutte le caratteristiche delle chiavi
presenti nel proprio portachiavi. &Egrave; possibile installare Seahorse da un
pacchetto Debian (gli RPM non sono ancora disponibili al momento) o dai
sorgenti. L'installazione dai sorgenti avviene come per gli altri programmi:
scaricare, decomprimere, configure e make install.
L'installazione pone seahorse in <CODE>/usr/local</CODE> e aggiunge un elemento
al men&ugrave; "Applicazioni" di GNOME.</P>

<H3>Geheimnis</H3>


<P>
<A HREF="http://geheimnis.sourceforge.net/">Geheimnis</A> &egrave; un
front-end per GnuPG basato su KDE.
Dovrebbe avere tutte le funzioni di GPA o Seahorse.
(Nota dell'autore: purtroppo quando ho provato a compilare il programma, mi
sono bloccato a causa di una libreria mancante: /usr/lib/libfam.la).</P>

<H2><A NAME="ss6.2">6.2</A> <A HREF="#toc6.2">Programmi di posta elettronica</A>
</H2>

<P>La maggior parte dei programmi di posta elettronica supportano GnuPG. Tra
i tanti:
<UL>
<LI>Mozilla</LI>
<LI>Pine</LI>
<LI>Kmail</LI>
<LI>Eudora</LI>
<LI>Mutt</LI>
<LI>exmh</LI>
</UL>
</P>
<P>Ce ne sono probabilmente molti di pi&ugrave;: &egrave; difficile elencarli tutti.</P>

<P>Usare un programma di posta elettronica con il supporto GnuPG permette di
decifrare i messaggi che sono stati cifrati con la propria chiave pubblica, 
firmare i propri messaggi in modo che il destinatario possa verificarne
l'autenticit&agrave; e cifrare la propria posta con la chiave pubblica dei
destinatari.</P>

<H3>Mozilla e Enigmail</H3>

<P>Mozilla non ha in s&eacute; il supporto per GnuPG. Per usare GnuPG con Mozilla
occorre installare un "plug-in", come
<A HREF="http://enigmail.mozdev.org/">EnigMail</A>.
Enigmail &egrave; un "plug-in" per Mozilla/Netscape Mail che permette agli utenti
di accedere alle capacit&agrave; di autenticazione e crittografia fornite da
programmi popolari come GPG e PGP.
Enigmail pu&ograve; cifrare/firmare la posta in uscita e decifrare/verificare
quella in entrata. Pu&ograve; anche importare ed esportare chiavi.</P>

<P>Installare EnigMail su un sistema Linux RedHat &egrave; facile, visto che sono
disponibili RPM per l'ultima versione di Mozilla.
Ci sono due pacchetti da installare: <CODE>mozilla-enigmail-0.39-3.i386.rpm</CODE>
e <CODE>mozilla-ipc-0.99-0_rh7x.rpm</CODE>.
Dopo aver installato questi RPM e aver riavviato Mozilla (o Netscape 6.x) si
&egrave; pronti per usare GnuPG nella propria posta.
Si noti tuttavia che EnigMail cifra solo i testi dei messaggi, non gli
allegati; occorrer&agrave; cifrare separatamente i file che si vuole allegare.
Su altri sistemi probabilmente occorre installare EnigMail dai sorgenti.</P>

<H3>Kmail</H3>

<P>Kmail, il programma di posta elettronica standard per KDE, ha il supporto
integrato per GnuPG e PGP.
Per impostare il programma in modo da poter firmare e cifrare i messaggi,
occorre inserire il proprio user ID di GnuPG nella sezione "Identit&agrave;" della
configurazione di Kmail. 
Quando si spedisce un messaggio, per firmarlo o cifrarlo occorre usare i
pulsanti "Firma messaggio" o "Cifra messaggio" sulla barra degli strumenti.</P>

<H2><A NAME="GPG-Minihowto-Informationsources"></A> <A NAME="s7">7.</A> <A HREF="#toc7">Fonti di informazioni</A></H2>



<H2><A NAME="ss7.1">7.1</A> <A HREF="#toc7.1">GnuPG</A>
</H2>


<P>
<UL>
<LI>La 
<A HREF="http://www.gnupg.org">homepage di GnuPG</A>
</LI>
<LI>La mailing list di GnuPG, gli archivi e le istruzioni sono disponibili sul
<A HREF="http://www.gnupg.org/docs.html">sito di GnuPG</A>.
</LI>
<LI>Le informazioni incluse nel progetto GnuPG (aggiornate fino alla versione 0.9.2),
anche se non ancora complete. Da non dimenticare anche:
<BLOCKQUOTE><CODE>
<PRE>
gpg --help
</PRE>
</CODE></BLOCKQUOTE>
 che fornisce informazioni molto utili.
 
</LI>
</UL>
</P>

<H2><A NAME="ss7.2">7.2</A> <A HREF="#toc7.2">PGP</A>
</H2>

<P>PGP &egrave; un programma di crittografia pi&ugrave; vecchio ma ancora molto diffuso ed
utilizzato.  Molti documenti prodotti negli scorsi anni per PGP sono ancora
utili, perch&egrave; molte informazioni contenute sono generali e valide anche per GnuPG.
Si controllino gli indirizzi seguenti:</P>
<P>
<UL>
<LI>La 
<A HREF="http://www.pgpi.com">Home page di PGP International</A></LI>
<LI>La 
<A HREF="http://www.hertreg.ac.uk/ss/pgpfaq.html">PGP DH vs. RSA FAQ</A>, con informazioni sulle differenze tra questi
due algoritmi, che sono usati da GnuPG.  </LI>
</UL>
</P>

<H2><A NAME="ss7.3">7.3</A> <A HREF="#toc7.3">Keyserver</A>
</H2>

<P>
<UL>
<LI> 
<A HREF="http://www.keyserver.net">Keyserver.net</A></LI>
<LI> 
<A HREF="http://wwwkeys.eu.pgp.net">http://wwwkeys.eu.pgp.net</A></LI>
</UL>
</P>

<H2><A NAME="ss7.4">7.4</A> <A HREF="#toc7.4">Libri</A>
</H2>


<P>
<UL>
<LI>B. Schneier, &quot;Applied Cryptography, Second
Edition&quot;, Wiley, 1996 
<A NAME="BSchneier"></A> </LI>
</UL>
</P>


<H2><A NAME="s8">8.</A> <A HREF="#toc8">Informazioni su questo documento </A></H2>

<P>Copyright &copy; 1999 Brenno J.S.A.A.F. de Winter (versione inglese)
Copyright &copy; 1999 Michael Fischer v. Mollard (versione originale tedesca)
Copyright &copy; 2002 Arjen Baart (versione olandese)
Copyright &copy; 2003 Cristian Rigamonti (versione italiana)</P>
<P>This document is free documentation you can redistribute it and/or
modify it under the terms of the GNU Library General Public
License as published by the Free Software Foundation; either
version 2 of the License, or (at your option) any later version.</P>
<P>This library is distributed in the hope that it will be useful,
but WITHOUT ANY WARRANTY; without even the implied warranty of
MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the GNU
Library General Public License for more details.</P>
<P>You should have received a copy of the GNU Library General Public
License along with this library; if not, write to the
Free Software Foundation, Inc., 59 Temple Place - Suite 330,
Boston, MA 02111-1307, USA.</P>

<H2><A NAME="ss8.1">8.1</A> <A HREF="#toc8.1">Versioni</A>
</H2>

<P><B>Versione 0.1 (tedesco)</B>
<UL>
<LI>Questa &egrave; la prima versione in tedesco.</LI>
</UL>
</P>

<P><B>Versione 0.1.0 (inglese) 30 aprile 1999</B>
<UL>
<LI>Questa versione &egrave; la traduzione in inglese della versione tedesca, con
alcuni aggiustamenti.</LI>
</UL>
</P>

<P><B>Versione 0.1.1 (tedesco)</B>
<UL>
<LI>Nuovo capitolo &quot;Limiti alla sicurezza&quot;</LI>
<LI>Migliorata la spiegazione delle firme</LI>
<LI>Modifiche dopo suggerimenti di Werner Koch (grazie!)</LI>
</UL>
</P>

<P><B>Versione 0.1.2 (inglese) 3 aprile 2002</B>
<UL>
<LI>Corretti alcuni errori di stampa.</LI>
<LI>Nuovo capitolo sui front-end.</LI>
</UL>
</P>

<P><B>Versione 0.1.3 (olandese) 17 maggio 2002</B>
<UL>
<LI>Questa versione &egrave; una traduzione in olandese della versione inglese.</LI>
</UL>
</P>

<P><B>Versione 0.1.4 (italiano) 12 maggio 2003</B>
<UL>
<LI>Questa versione &egrave; una traduzione in italiano della versione inglese.</LI>
</UL>
</P>


<P>For the English or Dutch version:
All remarks for this document can be sent to Brenno J.S.A.A.F. de Winter
(<CODE>
<A HREF="mailto:brenno@dewinter.com">brenno@dewinter.com</A></CODE>).
or Arjen Baart
(<CODE>
<A HREF="mailto:arjen@andromeda.nl">arjen@andromeda.nl</A></CODE>).
Comments help us make a better document and are greatly appreciated.</P>
<P>For the German version:
Anregungen, Kritik, Verbesserungen und Erweiterungen
einfach an Michael Fischer v. Mollard (<CODE>
<A HREF="mailto:fischer@math.uni-goettingen.de">fischer@math.uni-goettingen.de</A></CODE>) senden, damit dieses
Dokument weiter verbessert werden kann.</P>
<P>Per la versione italiana: 
inviare commenti e segnalazioni a Cristian Rigamonti 
(<CODE>
<A HREF="mailto:cri@linux.it">cri@linux.it</A></CODE>).</P>


</BODY>
</HTML>
